Revit 2015 API
Polyloop Class
 A Polyloop represent a planar polygon with ordered points.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2012
Syntax
C#
public class Polyloop : IDisposable
Visual Basic
Public Class Polyloop _
	Implements IDisposable
Visual C++
public ref class Polyloop : IDisposable
Remarks
 This class corresponds to IfcPolyLoop (see definition below). Definition from ISO/CD 10303-42:1992: An IfcPolyLoop is a loop with straight edges bounding a planar region in space. An IfcPolyLoop is a loop of genus 1 where the loop is represented by an ordered coplanar collection of points forming the vertices of the loop. The loop is composed of straight line segments joining a point in the collection to the succeeding point in the collection. The closing segment is from the last to the first point in the collection. The direction of the loop is in the direction of the line segments. All the points in the polygon defining the poly loop shall be coplanar.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.Polyloop
See Also
Polyloop Members
Autodesk.Revit.DB.Analysis Namespace